In [1]:
#1.>
import pandas as pd
df=pd.Series([4, 8, 15, 16, 23,42])
pd.concat([df])

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [2]:
#2.>
a=[1,2,3,4,5,6,7,8,9,10]
print(pd.Series([a]))

0    [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
dtype: object

In [13]:
#3.>
s1=pd.Series(['Alice',25,'Female'])
s2=pd.Series(['Bob',30,'Male'])
s3=pd.Series(['Charlie',27,'Female'])
df=pd.DataFrame([s1,s2,s3])
print(df)

         0   1       2
0    Alice  25  Female
1      Bob  30    Male
2  Charlie  27  Female

4.>DataFrame is a collection of Series in which data is arranged in Tabular fashion inrows and column where as Series is indivisual row. In before question the whole output is DataFrame and each indivisual rows are called series

In [16]:
#5.>
df.drop([1],axis=0)

         0   1       2
0    Alice  25  Female
2  Charlie  27  Female

In [17]:
df.drop([0],axis=1)

    1       2
0  25  Female
1  30    Male
2  27  Female

In [20]:
df.rename(columns={1:'asu'})

         0  asu       2
0    Alice   25  Female
1      Bob   30    Male
2  Charlie   27  Female

In [22]:
"""6.>By using concat() method you can merge multiple series together into DataFrame."""
s1=pd.Series([1,2,3])
s2=pd.Series([4,5,6])
df=pd.DataFrame([s1,s2])
print(df)

   0  1  2
0  1  2  3
1  4  5  6